### Handling Missing Data- Replace Method

In [1]:
import pandas as pd 
import numpy as np
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

**-99999 is not a reasonable number for temperature, so we aim to change it**

### Replacing A Single Value

In [2]:
new_df = df.replace(-99999, value = 5)
new_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017            5          7  Sunny
2  1/3/2017           28          5   Snow
3  1/4/2017            5          7      0
4  1/5/2017           32          5   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

### Replacing List With A Single Value

In [3]:
new_df = df.replace(to_replace = [-99999,-88888,10,'0'], value = 5)
new_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017            5          7  Sunny
2  1/3/2017           28          5   Snow
3  1/4/2017            5          7      5
4  1/5/2017           32          5   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      5

### Replacing Per Column

In [4]:
new_df = df.replace({
    'temperature': -99999,
    'windspeed':-99999,
    'day':'1/1/2017',
    'event':'0'
}, np.nan)
new_df

        day  temperature  windspeed  event
0       NaN         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### Replacing By Mapping

In [5]:
new_df = df.replace({
    -99999: np.nan,
    '0': 'Sunny'
})

new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

### Replacing Lists

In [9]:
df = pd.DataFrame({
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica'],
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional']
})

df

   student        score
0      rob  exceptional
1     maya      average
2  parthiv         good
3      tom         poor
4   julian      average
5    erica  exceptional

In [10]:
df.score.value_counts()

exceptional    2
average        2
good           1
poor           1
Name: score, dtype: int64

In [11]:
df.replace(['poor','average','good','exceptional'],[1,5,7,9])

   student  score
0      rob      9
1     maya      5
2  parthiv      7
3      tom      1
4   julian      5
5    erica      9

### Replace Specefic Data

In [21]:
df["student"].replace({'rob':'mohamed'},inplace= True)

In [22]:
df

   student        score
0  mohamed  exceptional
1     maya      average
2  parthiv         good
3      tom         poor
4   julian      average
5    erica  exceptional